### **Pandas**

In [1]:
import pandas as pd

In [21]:
# create a dictionary
dict1 = {
    "name": ["John", "Peter", "Linda", "Fahad"],
    "age": [23, 45, 67, 23],
    "city": ["New York", "Paris", "Berlin", "Sylhet"]
}
dict1

{'name': ['John', 'Peter', 'Linda', 'Fahad'],
 'age': [23, 45, 67, 23],
 'city': ['New York', 'Paris', 'Berlin', 'Sylhet']}

#### DataFrame

In [22]:
df = pd.DataFrame(dict1)
df

    name  age      city
0   John   23  New York
1  Peter   45     Paris
2  Linda   67    Berlin
3  Fahad   23    Sylhet

In [ ]:
# save the dataframe to a csv file
df.to_csv("data.csv")

In [14]:
# save the dataframe to a csv file without index
df.to_csv("data_without_index.csv", index=False)

In [27]:
# head(2) will show the first 2 rows or records
df.head(2)

    name  age      city
0   John   23  New York
1  Peter   45     Paris

In [24]:
# tail(2) will show the last 2 rows or records
df.tail(2)

    name  age    city
2  Linda   67  Berlin
3  Fahad   23  Sylhet

In [31]:
# describe() will show the statistical information of the data
df.describe()

             age
count   4.000000
mean   39.500000
std    21.063396
min    23.000000
25%    23.000000
50%    34.000000
75%    50.500000
max    67.000000

In [45]:
students = pd.read_csv("./studentInfo.csv",index_col=0)
students

    name   id      city
0   John  110  New York
1  Peter  111     Paris
2  Linda  112    Berlin
3  Kinda  113    Berlin

In [36]:
students["name"][3] = "Fahad"

C:\Users\ashfa\AppData\Local\Temp\ipykernel_7056\3309411696.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  students["name"][3] = "Fahad"

In [37]:
students

   Unnamed: 0   name   id      city
0           0   John  110  New York
1           1  Peter  111     Paris
2           2  Linda  112    Berlin
3           3  Fahad  113    Berlin

In [56]:
students.index = ['a', 'b', 'c', 'd']

In [57]:
students

    name   id      city
a   John  110  New York
b  Peter  111     Paris
c  Linda  112    Berlin
d  Kinda  113    Berlin

In [73]:
students.iloc[0]

name        John
id           110
city    New York
Name: a, dtype: object

In [76]:
students.loc['a']

name        John
id           110
city    New York
Name: a, dtype: object

In [77]:
students.iloc[0,1]

110

In [79]:
students.loc['a','id']

110

In [82]:
students.iloc[:,:]

    name   id      city
a   John  110  New York
b  Peter  111     Paris
c  Linda  112    Berlin
d  Kinda  113    Berlin

In [83]:
students.loc[:,:]

    name   id      city
a   John  110  New York
b  Peter  111     Paris
c  Linda  112    Berlin
d  Kinda  113    Berlin

In [92]:
students.iloc[1:3,:]

    name   id    city
b  Peter  111   Paris
c  Linda  112  Berlin

In [99]:
students.loc['b':'c',:]

    name   id    city
b  Peter  111   Paris
c  Linda  112  Berlin

In [101]:
students.iloc[1:3,1:3]

    id    city
b  111   Paris
c  112  Berlin

In [103]:
students.loc['b':'c','id':'city']

    id    city
b  111   Paris
c  112  Berlin

In [105]:
students.iloc[[0,1,3],:]

    name   id      city
a   John  110  New York
b  Peter  111     Paris
d  Kinda  113    Berlin

In [106]:
students.loc[['a','b','d'],:]

    name   id      city
a   John  110  New York
b  Peter  111     Paris
d  Kinda  113    Berlin

In [127]:
students.iloc[-3:,:]

    name   id    city
b  Peter  111   Paris
c  Linda  112  Berlin
d  Kinda  113  Berlin